docs/input-data/crac/creation-context.md
```{mermaid}
classDiagram
    class CracCreationContext {
        <<interface>>
        +boolean isCreationSuccessful()
        +Crac getCrac()
        +OffsetDateTime getTimeStamp()
        +String getNetworkName()
        +CracCreationReport getCreationReport()
    }
    CracCreationContext <|-- UcteCracCreationContext

    class UcteCracCreationContext {
        <<interface>>
        +List~? extends BranchCnecCreationContext~ getBranchCnecCreationContexts()
        +BranchCnecCreationContext getBranchCnecCreationContext(String branchCnecId)
        +List~? extends ElementaryCreationContext~ getRemedialActionCreationContexts()
        +ElementaryCreationContext getRemedialActionCreationContext(String remedialActionId)
    }

    UcteCracCreationContext "1" *--> "*" BranchCnecCreationContext
    UcteCracCreationContext "1" *--> "*" ElementaryCreationContext

    class ElementaryCreationContext {
        <<interface>>
        +String getNativeObjectId()
        +String getNativeObjectName()
        +String getCreatedObjectId()
        +Set~String~ getCreatedObjectsIds()
        +boolean isImported()
        +boolean isAltered()
        +ImportStatus getImportStatus()
        +String getImportStatusDetail()
    }

    class BranchCnecCreationContext {
        <<interface>>
        +NativeBranch getNativeBranch()
        +boolean isBaseCase()
        +Optional~String~ getContingencyId()
        +Map~String, String~ getCreatedCnecsIds()
        +boolean isDirectionInvertedInNetwork()
    }

    BranchCnecCreationContext --|> ElementaryCreationContext

    class ImportStatus {
        <<enumeration>>
        +IMPORTED
        +ELEMENT_NOT_FOUND_IN_NETWORK
        +INCOMPLETE_DATA
        +INCONSISTENCY_IN_DATA
        +NOT_YET_HANDLED_BY_OPEN_RAO
        +NOT_FOR_RAO
        +NOT_FOR_REQUESTED_TIMESTAMP
        +OTHER
    }
    ElementaryCreationContext "1" *--> "1" ImportStatus
```
