docs/input-data/crac/creation-context.md
```{mermaid}
classDiagram
    class UcteCracCreationContext {
        <<interface>>
    }
    UcteCracCreationContext <|-- CseCracCreationContext

    class CseCracCreationContext {
        +ElementaryCreationContext getOutageCreationContext(String outageName)
        +List~ElementaryCreationContext~ getOutageCreationContexts()
    }
    CseCracCreationContext "1" *--> "*" ElementaryCreationContext

    class ElementaryCreationContext {
        <<interface>>
    }
```
