docs/input-data/crac/creation-context.md
```{mermaid}
classDiagram
    class CracCreationContext {
        <<interface>>
    }
    CracCreationContext <|-- CsaProfileCracCreationContext

    class CsaProfileCracCreationContext {
        +Set~ElementaryCreationContext~ getContingencyCreationContexts()
        +Set~ElementaryCreationContext~ getRemedialActionCreationContexts()
        +ElementaryCreationContext getRemedialActionCreationContext(String nativeId)
        +Set~ElementaryCreationContext~ getCnecCreationContexts()
    }

    CsaProfileCracCreationContext "1" *--> "*" ElementaryCreationContext

    class ElementaryCreationContext {
        <<interface>>
    }
```
